{
  "auto_map": {
    "AutoTokenizer": [
      "chatglm2-6b--tokenization_chatglm.ChatGLMTokenizer",
      null
    ]
  },
  "clean_up_tokenization_spaces": true,
  "do_lower_case": false,
  "model_max_length": 1000000000000000019884624838656,
  "padding_side": "left",
  "remove_space": false,
  "tokenizer_class": "ChatGLMTokenizer"
}
